doc/pokedex_db.md
```mermaid
erDiagram
    regions {
        bigint id PK
        varchar_255 name
    }

    types {
        bigint id PK
        varchar_255 name
        varchar_7 color
    }

    egg_groups {
        bigint id PK
        varchar_255 name
    }

    species {
        bigint id PK
        varchar_10 pokemon_number
        varchar_255 name
        varchar_255 species_en
        varchar_255 species_pt
    }

    generations {
        bigint id PK
        varchar_255 name
        bigint region_id FK
    }

    abilities {
        bigint id PK
        varchar_255 name
        text description
        bigint introduced_generation_id FK
    }

    pokemons {
        bigint id PK
        varchar_10 number
        varchar_255 name
        numeric_5_2 height
        numeric_6_2 weight
        text description
        jsonb sprites
        integer gender_rate_value
        integer egg_cycles
        bigint stats_id FK
        bigint generation_id FK
        bigint species_id FK
        bigint region_id FK
        bigint evolution_chain_id FK
    }

    stats {
        bigint id PK
        varchar_4 pokemon_national_pokedex_number
        integer total
        integer hp
        integer attack
        integer defense
        integer sp_atk
        integer sp_def
        integer speed
    }

    pokemon_types {
        bigint pokemon_id PK
        bigint type_id PK
    }

    pokemon_abilities {
        bigserial id PK
        bigint pokemon_id FK
        bigint ability_id FK
        boolean is_hidden
    }

    pokemon_egg_groups {
        bigint pokemon_id PK
        bigint egg_group_id PK
    }

    evolution_chains {
        bigint id PK
    }

    evolution_links {
        bigint evolution_chain_id PK
        bigint pokemon_id PK
        bigint target_pokemon_id
        varchar_255 condition_type
        varchar_255 condition_value
    }

    pokemon_weaknesses {
        bigint pokemon_id PK
        bigint type_id PK
    }

    %% -------------------------
    %% RELACIONAMENTOS
    %% -------------------------

    regions ||--o{ generations : "1:N gerações"
    generations ||--o{ pokemons : "1:N introduz Pokémon"
    generations ||--o{ abilities : "1:N introduz habilidades"
    species ||--o{ pokemons : "1:N define espécie"
    pokemons ||--|| stats : "1:1 possui stats"
    pokemons ||--o{ pokemon_types : "1:N tipos"
    types ||--o{ pokemon_types : "1:N usado por Pokémon"
    pokemons ||--o{ pokemon_abilities : "1:N habilidades"
    abilities ||--o{ pokemon_abilities : "1:N usada por Pokémon"
    pokemons ||--o{ pokemon_egg_groups : "1:N grupos de ovos"
    egg_groups ||--o{ pokemon_egg_groups : "1:N contém Pokémon"
    evolution_chains ||--o{ evolution_links : "1:N links"
    pokemons ||--o{ evolution_links : "1:N participa"
    pokemon_weaknesses ||--|| pokemons : "N:N fraquezas"
    pokemon_weaknesses ||--|| types : "N:N tipos fracos"
```
